{"aries": "Beating yourself up over making a decision is something you want to avoid right now -- plus, that pessimistic mindset could become a self-fulfilling prophecy. Instead, resolve to make the best of things, and see how well it goes.", "taurus": "Pushing yourself into making a choice will cause you more stress than anything else, so ease up. Just accept that there may be more of a gray area than you'd like right now. The situation will resolve itself in no time.", "gemini": "It's time to break a lifelong habit, especially if it's doing you more harm than good. Go slowly, and acknowledge even the smallest movements as progress. It took you a while to build this habit, and it'll take you time to break it.", "cancer": "It's tough slogging through to your final destination when there are subliminal matters holding you back. Take some time to get your head clear rather than barreling through these current obstacles. Things will be much clearer for longer that way.", "leo": "Romance sizzles, especially if you try and go deep. Rather than letting superficial ego concerns get in the way, explore what's under the surface. Talk about what makes you tick. Find out what's really going on with your partner.", "virgo": "Tiptoe away from any meetings that look like they could develop into confrontations; you're feeling a touch introspective and really aren't up to dealing with someone else's mood. Be clear that you need your space now.", "libra": "Everyone's clamoring for your opinion and your attention, and you're more than willing to lend an ear when you can. Go ahead and soak up all the attention -- earthy types like yourself love all this contact with people.", "scorpio": "Passion moves in and changes your perspective. While this may apply primarily to a romantic relationship, it could just as easily apply to how fully you invest yourself in your work or a hobby. You need to be fully invested in what you do.", "sagittarius": "Something that everyone else thought was an impossibility takes yet another step toward becoming a reality, thanks to you. You receive accolades and encouragement you didn't think possible. Keep it up.", "capricorn": "Friends are high on the agenda, as they should be. Gather your crew together -- you've got the magic touch when it comes to getting people together -- but appoint someone else in charge of deciding what the final plans are for tonight.", "aquarius": "Your social circle sets up lots and lots of delicious distractions, which won't displease you one bit. Encounters are giddy and enticing -- and possibly romantic as well. Get your to-do list out of the way and focus on having fun ASAP.", "pisces": "There's a lot to look forward to, especially with the stars' benevolent influence over your social calendar. Make sure to get out there as much as possible and meet as many people as you can."}